/*
    함수(Function) : 미리 정의된 수/코드  , 상자안에 들어오는 수/코드, 함(상자) 수(숫자/코드) 
        - 목적 : 1.재사용 2.매개변수에 따른 서로다른 결과물 3.지역변수
        * 매개변수(Parameter) : 함수호출하는 인자 와 함수실행하는 변수 연결 
        * 변수 : 하나의 값/자료 저장   , * 인자값 : 함수에 전달하는 값 
        - 종류 : 1. 미리만들어진함수(라이브러리) 2. 내가만든함수 

// [1] 사용법 
// 1. 미리만들어진함수 : 라이브러리 , 각 프로그래밍 회사에서 제공 * 함수호출만
console.log( "함수1" )
// document.querySelector('body').innerHTML = '함수2'

// 2. 내가만드는함수 : 정의함수 , 개발자(내가) 함수 직접 정의 , * 함수도 자료의 타입 이다.
// * 함수정의 
// 1) function     2) 함수명    3)  ( 매개변수1, 매개변수2 )    4) {  실행코드;  }
function func1( 매개변수1 ){
    // 실행코드
    console.log( 매개변수1 ) // 3 
} // f end 
// * 함수호출 
// 5) 호출할함수명   6) ( 인자값 )  ,   * 3 이라는 인자값이 매개변수1 에 저장된다.
func1( 3 ); // 

// [2] 예시1 : 믹서기함수는 과일을 매개변수로 받아서 과일주스 반환한다.  
function 믹서기함수( 과일 ){ 
    return 과일+"주스"; // *함수가 종료되면서 반환 하는 값 
} // f end 
let 컵1 = 믹서기함수( '사과' ) // 믹서기함수에 '사과'를 인자값으로 전달 하여 '사과주스' 반환하여 컵1에 저장 
let 컵2 = 믹서기함수( '포도' ) // 믹서기함수에 '포도' 인자값으로 전달 하여 '포도주스' 반환하여 컵2에 저장

// [3] 예시2 : 수학공식함수는 x 와 y 매개변수로 받아서  
function 수학공식함수( x , y ){
    a = x + y   // 더하기  
    return a    // 반환 // 오직 하나만 나오는 규칙 *반환값 1번이면서 자료1개
} // f end 
let 결과1 = 수학공식함수( 3 , 5 )  // x=3 , y = 5 , 8
let 결과2 = 수학공식함수( 3 , -2 ) // x=3 , y = -2 , 1
// ==========================================================================================
// 1. 매개변수x , 반환값x 
function func2( ){ console.log( 'func2 exe' ); y = 3 + 2; }
func2( )
// 2. 매개변수o , 반환값x     예] console.log( )
function func3( x ){ console.log( 'func3 exe'); y = x + 2; }
func3( 10 )
// 3. 매개변수o , 반환값o     예] prompt( ) * 반환값이 있는 함수는 반환값을 변수에 저장한다.
function func4( x ){ console.log( 'func4 exe'); y = x + 2; return y; }
let result4 = func4( 10 );  //   let result4 = 12 ( x = 10 , 10+2 )
// 4. 매개변수x , 반환값o     예] 추후에 다양한 함수들이 사용되는데 내가만든 함수가 아니므로 무엇을 반환하는지 공문서/AI/구글 확인
function func5( ){ console.log( 'func5 exe'); y = 3 + 2; return y; }
let result5 = func5( );     // let result5 = 5 ( 3 + 2 )
// ==========================================================================================
// 1. 지역변수 : if , for , function 문법 { } 에서 선언(let) 된 변수 ,  (선언) let a = 10 vs  (호출/수정) a = 20 
let 전역변수 = '대한민국' // 1] 해당 변수는 어떠한 { } 포함되는 선언이 아니므로 모든 곳에서 호출 가능
if( true ){
    let 지역변수1 = '경기도' // 2] 해당 변수는 if{ } 에서 선언된 변수
    console.log( 전역변수 ); // { } 밖으로 나가는 불가능 하지만 { } 안으로 들어가는건 가능 
    for( let i = 1 ; i <= 1 ; i++ ){ 
        let 지역변수2 = '안양시' // 3] 해당 변수는 for{ } 에서 선언된 변수 
        console.log( 지역변수1 ); // { } 밖 x , { } 안 o
        console.log( 지역변수2 );
    } // for end 
    // console.log( 지역변수2 ) // 오류X : { } 밖 X , 
    if( true ){
        let 지역변수3 = '성남시'
        // console.log( 지역변수2 ); // 오류X : { } 밖 X
    } // if end 
} // if end 
console.log( 전역변수 ) // 오류X : 특정한 { } 선언이 아니므로 사용가능
// console.log( 지역변수1 ) // 오류O : 지역변수1 은 if{} 선언 했으므로 그 안에서만 사용가능

// 2. 지역변수2 : if , for 과 다르게 function 은 return 반환 키워드 이용한 지역변수의 값 이동
function func6( ){ 
    let 지역변수4 = '수원시';
    return 지역변수4;
}
let 전역변수2 = func6( );

// 3. HTML에서 함수 호출 방법
function func7( ){ console.log('func7 exe') }
// 3-1 : JS에서 함수 호출 방법 : 함수명( 매개변수 )
func7( )
// 3-2 : HTML 에서 함수 호출 방법 : <마크업 onClick="JS함수명()" />

*/